vlm/base/Documents/ПриходныйОрдерНаТовары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПриходныйОрдерНаТовары</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.ПриобретениеТоваровУслуг</xr:Item>
				<xr:Item>Document.ВозвратТоваровОтКлиента</xr:Item>
				<xr:Item>Document.ЗаявкаНаВозвратТоваровОтКлиента</xr:Item>
				<xr:Item>Document.ПеремещениеТоваров</xr:Item>
				<xr:Item>Document.СборкаТоваров</xr:Item>
				<xr:Item>Document.ПрочееОприходованиеТоваров</xr:Item>
				<xr:Item>Document.ЗаказНаСборку</xr:Item>
				<xr:Item>Document.ЗаказНаПеремещение</xr:Item>
				<xr:Item>Document.МаршрутныйЛистПроизводства</xr:Item>
				<xr:Item>Document.ЗаказПереработчику</xr:Item>
				<xr:Item>Document.ЗаказПереработчику2_5</xr:Item>
				<xr:Item>Document.ПоступлениеОтПереработчика</xr:Item>
				<xr:Item>Document.ЗаказДавальца</xr:Item>
				<xr:Item>Document.ПоступлениеСырьяОтДавальца</xr:Item>
				<xr:Item>Document.ЗаказНаПроизводство</xr:Item>
				<xr:Item>Document.ВозвратСырьяОтПереработчика</xr:Item>
				<xr:Item>Document.ВыпускПродукции</xr:Item>
				<xr:Item>Document.ВозвратМатериаловИзПроизводства</xr:Item>
				<xr:Item>Document.ЗаказДавальца2_5</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвиженияСерийТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКОформлениюИзлишковНедостач</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВЯчейках</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКПоступлению</xr:Item>
				<xr:Item>AccumulationRegister.ЗапасыИПотребности</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Распоряжение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаПоступление</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПриходныхОрдеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаПриемки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспоряжениеНаНесколькоСкладов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладскаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СкладскиеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЗаполненияМногооборотнойТары</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗаполненияМногооборотнойТары</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимПросмотраПоТоварам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегоМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтправительПолучательТоваров</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОтгрузки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаОтгрузку</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УпаковочныйЛист</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УпаковочныйЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УпаковочныйЛистРодитель</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УпаковочныйЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоУпаковочныйЛист</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШтрихкодыУпаковок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ШтрихкодУпаковки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

vlm/base/CommonModules/ПриходныйОрдерНаТоварыЛокализация/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Обработка проверки заполнения.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Отказ - Булево
//  ПроверяемыеРеквизиты - Массив из Строка - Проверяемые реквизиты
Процедура ОбработкаПроверкиЗаполнения(Форма, Отказ, ПроверяемыеРеквизиты) Экспорт 
	
	//++ Локализация
	
	ОтказПроверки = Ложь;
	ПроверкаЗаполненияМаркируемойПродукции(Форма, ОтказПроверки);
	
	//-- Локализация
	
КонецПроцедуры

// Обработка заполнения.
// 
// Параметры:
//  ДокументОбъект - ДокументОбъект.ПриходныйОрдерНаТовары -
//  ДанныеЗаполнения - Структура -
//  СтандартнаяОбработка - Булево -
Процедура ОбработкаЗаполнения(ДокументОбъект, ДанныеЗаполнения, СтандартнаяОбработка)Экспорт

	//++ Локализация
	Если НЕ ДокументОбъект.ЭтоНовый()
		ИЛИ НЕ ОбщегоНазначенияИСМП.ИспользуетсяМаркируемаяПродукция() 
		ИЛИ НЕ ДанныеЗаполнения.Свойство("Распоряжение") 
		ИЛИ ТипЗнч(ДанныеЗаполнения.Распоряжение) <> Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
		Возврат;
	КонецЕсли; 
	
	ЗаполнитьШтрихкодыУпаковокПоРаспоряжению(ДокументОбъект, ДанныеЗаполнения);
	
	//-- Локализация

КонецПроцедуры

// При создании на сервере.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Отказ - Булево
//  СтандартнаяОбработка - Булево
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	//++ Локализация
	ЗаполнитьКешированныеЗначения(Форма);
	//-- Локализация
	
КонецПроцедуры
	 
#Область МаркируемаяПродукция

// Определяет ведение учета маркируемой продукции.
// 
// Возвращаемое значение:
//  Булево - Используется маркируемая продукция
Функция ИспользуетсяМаркируемаяПродукция() Экспорт
	
	Возврат СкладыЛокализация.ИспользуетсяМаркируемаяПродукция();
	
КонецФункции

// Установить признак использования маркируемой продукции.
// 
// Параметры:
//  Форма - см. СкладыЛокализация.УстановитьПризнакИспользованияМаркируемойПродукции.Форма
Процедура УстановитьПризнакИспользованияМаркируемойПродукции(Форма) Экспорт
	
	СкладыЛокализация.УстановитьПризнакИспользованияМаркируемойПродукции(Форма);

	//++ Локализация
	ЗаполнитьКешированныеЗначения(Форма);
	//-- Локализация
	
КонецПроцедуры

// Определение признака маркируемая продукция текста запроса.
// 
// Параметры:
//  ПутьКПолюНоменклатура -Строка -Путь к полю номенклатура
// 
// Возвращаемое значение:
//  Строка - Определение признака маркируемая продукция текста запроса
Функция ОпределениеПризнакаМаркируемаяПродукцияТекстаЗапроса(ПутьКПолюНоменклатура) Экспорт
	
	Результат = "";
	//++ Локализация
	Результат = ИнтеграцияИСУТ.ОпределениеПризнакаМаркируемаяПродукцияТекстаЗапроса(ПутьКПолюНоменклатура);
	//-- Локализация
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ Локализация

#Область СопоставлениеКоличестваМарок
	
// Параметры:
//	Ордер - ДокументОбъект.РасходныйОрдерНаТовары
//	Отказ - Булево
Процедура ПроверкаЗаполненияМаркируемойПродукции(Ордер, Отказ)
	
	СтатусыКонтроля = СтатусыКонтроляМаркировки();
	СкладскиеОперацииКонтроля = СкладскиеОперацииКонтроляМаркировки(); 
	Если ТипЗнч(Ордер) <> Тип("ДокументОбъект.ПриходныйОрдерНаТовары")
		ИЛИ СкладскиеОперацииКонтроля.Найти(Ордер.СкладскаяОперация) = Неопределено
		ИЛИ СтатусыКонтроля.Найти(Ордер.Статус) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ОбщегоНазначенияИСМП.ИспользуетсяМаркируемаяПродукция() Тогда
		Возврат;
	КонецЕсли; 
	
	ИнтеграцияИСУТ.ПроверитьЗаполнениеАкцизныхМарок(Ордер, Отказ);
	
КонецПроцедуры

Функция СтатусыКонтроляМаркировки()
	
	СтатусыКонтроля = Новый Массив;
	СтатусыКонтроля.Добавить(Перечисления.СтатусыПриходныхОрдеров.Принят);
	
	Возврат СтатусыКонтроля;
	
КонецФункции

Функция СкладскиеОперацииКонтроляМаркировки()

	СкладскиеОперацииКонтроля = Новый Массив;
	СкладскиеОперацииКонтроля.Добавить(Перечисления.СкладскиеОперации.ПриемкаОтПоставщика);
	СкладскиеОперацииКонтроля.Добавить(Перечисления.СкладскиеОперации.ПриемкаПоВозвратуОтКлиента);
	СкладскиеОперацииКонтроля.Добавить(Перечисления.СкладскиеОперации.ВозвратНеПринятыхТоваров);
	
	Возврат СкладскиеОперацииКонтроля;
	
КонецФункции

#КонецОбласти

// Параметры:
//	Ордер - ДокументОбъект.ПриходныйОрдерНаТовары -
//	ДанныеЗаполнения - Структура - 
Процедура ЗаполнитьШтрихкодыУпаковокПоРаспоряжению(Ордер, ДанныеЗаполнения)
	
	ТаблицаШтрихкодыУпаковок = Ордер.ШтрихкодыУпаковок;
	
	ТаблицаШтрихкодыУпаковок.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Распоряжение",ДанныеЗаполнения.Распоряжение);
	Запрос.УстановитьПараметр("СопоставлениеВидовПродукции",СопоставлениеВидовПродукцииИСМП());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СопоставлениеВидовПродукции.ВидПродукцииИС КАК ВидПродукцииИС,
	|	СопоставлениеВидовПродукции.ОсобенностьУчета КАК ОсобенностьУчета
	|ПОМЕСТИТЬ СопоставлениеВидовПродукции
	|ИЗ
	|	&СопоставлениеВидовПродукции КАК СопоставлениеВидовПродукции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УпаковкиОрдеров.ПриходныйОрдер КАК ПриходныйОрдер,
	|	УпаковкиОрдеров.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	|	УпаковкиОрдеров.ЭтоМультитоварнаяУпаковка КАК ЭтоМультитоварнаяУпаковка,
	|	УпаковкиОрдеров.ВидПродукцииИС КАК ВидПродукцииИС
	|ПОМЕСТИТЬ МаркиПринятые
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ШтрихкодыУпаковокОрдеров.Ссылка КАК ПриходныйОрдер,
	|		ШтрихкодыУпаковокОрдеров.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	|		ВЫБОР
	|			КОГДА ШтрихкодыУпаковокОрдеров.ШтрихкодУпаковки.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МультитоварнаяУпаковка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ЭтоМультитоварнаяУпаковка,
	|		ВЫБОР
	|			КОГДА ШтрихкодыУпаковокОрдеров.ШтрихкодУпаковки.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МультитоварнаяУпаковка)
	|				ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ СопоставлениеВидовПродукции.ВидПродукцииИС
	|		КОНЕЦ КАК ВидПродукцииИС
	|	ИЗ
	|		Документ.ПриходныйОрдерНаТовары.ШтрихкодыУпаковок КАК ШтрихкодыУпаковокОрдеров
	|			ЛЕВОЕ СОЕДИНЕНИЕ СопоставлениеВидовПродукции КАК СопоставлениеВидовПродукции
	|			ПО ШтрихкодыУпаковокОрдеров.ШтрихкодУпаковки.Номенклатура.ОсобенностьУчета = СопоставлениеВидовПродукции.ОсобенностьУчета
	|	ГДЕ
	|		ШтрихкодыУпаковокОрдеров.Ссылка.Распоряжение = &Распоряжение
	|		И ШтрихкодыУпаковокОрдеров.Ссылка.Проведен) КАК УпаковкиОрдеров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПроверкиИПодбораДокументовИС КАК СтатусыПроверкиИПодбораДокументовИС
	|		ПО УпаковкиОрдеров.ПриходныйОрдер = СтатусыПроверкиИПодбораДокументовИС.Документ
	|ГДЕ
	|	СтатусыПроверкиИПодбораДокументовИС.СтатусПроверкиИПодбора = ЗНАЧЕНИЕ(Перечисление.СтатусыПроверкиИПодбораИС.Завершено)
	|	И ВЫБОР
	|			КОГДА УпаковкиОрдеров.ЭтоМультитоварнаяУпаковка
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ УпаковкиОрдеров.ВидПродукцииИС = СтатусыПроверкиИПодбораДокументовИС.ВидМаркируемойПродукции
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаркиПриобретения.ШтрихкодУпаковки КАК ШтрихкодУпаковки
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.ШтрихкодыУпаковок КАК МаркиПриобретения
	|		ЛЕВОЕ СОЕДИНЕНИЕ МаркиПринятые КАК МаркиПринятые
	|		ПО МаркиПриобретения.ШтрихкодУпаковки = МаркиПринятые.ШтрихкодУпаковки
	|ГДЕ
	|	МаркиПриобретения.Ссылка = &Распоряжение
	|	И МаркиПриобретения.ШтрихкодУпаковки <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|	И МаркиПринятые.ШтрихкодУпаковки ЕСТЬ NULL";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока =  ТаблицаШтрихкодыУпаковок.Добавить();
		НоваяСтрока.ШтрихкодУпаковки = Выборка.ШтрихкодУпаковки;
	КонецЦикла; 
	
КонецПроцедуры

// Возвращаемое значение:
// 	ТаблицаЗначений:
//		*ВидПродукцииИС - ПеречислениеСсылка.ВидыПродукцииИС
//		*ОсобенностьУчета - ПеречислениеСсылка.ОсобенностиУчетаНоменклатуры
Функция СопоставлениеВидовПродукцииИСМП()
	
	ТаблицаСопоставления = Новый ТаблицаЗначений;
	ТаблицаСопоставления.Колонки.Добавить("ВидПродукцииИС",   Новый ОписаниеТипов("ПеречислениеСсылка.ВидыПродукцииИС"));
	ТаблицаСопоставления.Колонки.Добавить("ОсобенностьУчета", Новый ОписаниеТипов("ПеречислениеСсылка.ОсобенностиУчетаНоменклатуры"));
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидПродукции КАК ВидПродукции
	|ИЗ
	|	РегистрСведений.НастройкиУчетаМаркируемойПродукцииИСМП
	|ГДЕ
	|	ВестиУчетПродукции";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОсобенностьУчета = ИнтеграцияИСУТКлиентСервер.ОсобенностьУчетаПоВидуПродукции(Выборка.ВидПродукции);
		Если ЗначениеЗаполнено(ОсобенностьУчета) 
			И ТипЗнч(ОсобенностьУчета) = Тип("ПеречислениеСсылка.ОсобенностиУчетаНоменклатуры") Тогда
			
			НоваяСтрока = ТаблицаСопоставления.Добавить();
			НоваяСтрока.ВидПродукцииИС = Выборка.ВидПродукции;
			НоваяСтрока.ОсобенностьУчета = ОсобенностьУчета;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаСопоставления;
	
КонецФункции // СопоставлениеВидовПродукцииИСМП()

// Параметры:
//  Форма - см. Документ.ПриходныйОрдерНаТовары.Форма.ФормаДокумента
//	
Процедура ЗаполнитьКешированныеЗначения(Форма) 
	
	ЦелевойРеквизитИмя = "КэшКонтрагентаРаспоряжения";
	
	Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, ЦелевойРеквизитИмя) Тогда
		НовыйРеквизит = Новый РеквизитФормы(ЦелевойРеквизитИмя, Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
		КоллекцияРеквизитов = Новый Массив;
		КоллекцияРеквизитов.Добавить(НовыйРеквизит);
		Форма.ИзменитьРеквизиты(КоллекцияРеквизитов);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Распоряжение = Форма.Объект.Распоряжение;
	РеквизитКонтрагент = "Контрагент";
	Если ЗначениеЗаполнено(Распоряжение)
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Распоряжение, РеквизитКонтрагент) Тогда
		Форма[ЦелевойРеквизитИмя] = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Распоряжение, РеквизитКонтрагент);
	Иначе
		Форма[ЦелевойРеквизитИмя] = Неопределено; 
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

//-- Локализация

#КонецОбласти
